// Мінімум //

// Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.//
const count = 0.1 + 0.2;
const countFixed = +count.toFixed(1);

// Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.//
const num1 = "1";
const num2 = 2;
const countNum = +num1 + num2;

// Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.//
const volume = +prompt("Введіть об'єм флешки в гігабайтах");
const counter = Math.floor(volume / 0.82);
const volumeCounter = `На флешку об'ємом ${volume} Гб можна завантажити ${counter} файлів об'ємом 820 Мб`;

export { countFixed, countNum, volumeCounter };
